//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//######################################################################

let num = parseInt(prompt('أدخل رقمًا:'));
let factors: number[] = [];

if (!isNaN(num)) {
  for (let i = 1; i <= num; i++) {
    if (num % i === 0) {
      factors.push(i);
    }
  }
  console.log(`عوامل الرقم ${num}:`, factors);
} else {
  console.log('الرجاء إدخال رقم صحيح.');
}
